/*
Navicat MySQL Data Transfer

Source Server         : localhost
Source Server Version : 50723
Source Host           : localhost:3306
Source Database       : sms

Target Server Type    : MYSQL
Target Server Version : 50723
File Encoding         : 65001

Date: 2019-07-17 11:15:02
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `sms`
-- ----------------------------
DROP TABLE IF EXISTS `sms`;
CREATE TABLE `sms` (
  `id` char(32) NOT NULL,
  `template` varchar(100) NOT NULL COMMENT '模板id',
  `receiver` varchar(100) NOT NULL COMMENT '接收人手机号码',
  `params` varchar(200) DEFAULT NULL COMMENT '模板参数列表，jso格式map',
  `content` varchar(255) DEFAULT NULL COMMENT '短信内容',
  `sid` varchar(50) DEFAULT NULL COMMENT '发送该短信的服务提供商代码',
  `status` int(11) DEFAULT NULL COMMENT '状态，接口响应状态码',
  `times` int(11) DEFAULT NULL COMMENT '重试次数',
  `create_time` timestamp NULL DEFAULT NULL COMMENT '创建时间',
  `update_time` timestamp NULL DEFAULT NULL COMMENT '修改时间',
  `smsid` varchar(100) DEFAULT NULL COMMENT '流水号',
  `report_time` timestamp NULL DEFAULT NULL COMMENT '回执时间',
  `report_msg` varchar(200) DEFAULT NULL COMMENT '回执状态说明',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

-- ----------------------------
-- Records of sms
-- ----------------------------
INSERT INTO `sms` VALUES ('148cbbbca57548419981ac2925859bbc', '1', '18375315178', '{\"verify\":\"3581\"}', '您的验证码是：3581。请不要把验证码泄露给其他人。', 'ihuyi', '2', '0', '2019-06-28 10:43:15', '2019-06-28 10:43:16', '15616897968683190593', null, null);
INSERT INTO `sms` VALUES ('151319547d7d4572b5dbf4434104bf6c', '1', '13646841512', '{\"verify\":\"1209\"}', '您的验证码是：1209。请不要把验证码泄露给其他人。', 'ihuyi', '2', '0', '2019-07-11 10:30:14', '2019-07-11 10:30:15', '15628122155867204367', null, null);
INSERT INTO `sms` VALUES ('1f07d71eb49b433988720f3ca04656b9', '1', '13646841512', '{\"verify\":\"6816\"}', '您的验证码是：6816。请不要把验证码泄露给其他人。', 'ihuyi', '2', '0', '2019-07-11 10:27:57', '2019-07-11 10:27:58', '15628120783794228564', null, null);
INSERT INTO `sms` VALUES ('2e564372ac974f30a6c826419db3d1bf', '1', '18857193039', '{\"verify\":\"7242\"}', '您的验证码是：7242。请不要把验证码泄露给其他人。', 'ihuyi', '2', '0', '2019-07-11 13:42:53', '2019-07-11 13:42:54', '15628237742874232914', null, null);
INSERT INTO `sms` VALUES ('325392f82bfb43ba8e6bd9eecd5398ce', '1', '18857193039', '{\"verify\":\"4510\"}', '您的验证码是：4510。请不要把验证码泄露给其他人。', 'ihuyi', '2', '0', '2019-07-11 16:55:58', '2019-07-11 16:55:59', '15628353592945164529', null, null);
INSERT INTO `sms` VALUES ('32f0224ddc7744acb65c1dcd8a8c8da2', '1', '13646841512', '{\"verify\":\"6503\"}', '您的验证码是：6503。请不要把验证码泄露给其他人。', 'ihuyi', '2', '0', '2019-07-12 15:35:35', '2019-07-12 15:35:36', '15629169364577233517', null, null);
INSERT INTO `sms` VALUES ('3794376e6ce9499e9dbee23305615228', '1', '18375315178', '{\"verify\":\"062237\"}', '您的验证码是：062237。请不要把验证码泄露给其他人。', 'ihuyi', '2', '0', '2019-06-28 10:52:51', '2019-06-28 10:52:52', '15616903721027236669', null, null);
INSERT INTO `sms` VALUES ('3bbde2d5b30845909bc67112290fed63', '1', '18857193039', '{\"verify\":\"8463\"}', '您的验证码是：8463。请不要把验证码泄露给其他人。', 'ihuyi', '2', '0', '2019-07-10 18:03:46', '2019-07-10 18:03:47', '15627530277019259347', null, null);
INSERT INTO `sms` VALUES ('3e1fd7b15b1846b78f9c38d8a2250894', '1', '13646841512', '{\"verify\":\"3730\"}', '您的验证码是：3730。请不要把验证码泄露给其他人。', 'ihuyi', '2', '0', '2019-07-10 18:04:03', '2019-07-10 18:04:15', '15627530551321161277', null, null);
INSERT INTO `sms` VALUES ('4e8d8c18d0cf4986963e4fa68eda9e7b', '1', '18857193039', '{\"verify\":\"9329\"}', '您的验证码是：9329。请不要把验证码泄露给其他人。', 'ihuyi', '2', '0', '2019-07-11 11:26:39', '2019-07-11 11:26:40', '15628156005925418975', null, null);
INSERT INTO `sms` VALUES ('52bd04a70a7d4cf19185cb319db4dc25', '1', '13646841512', '{\"verify\":\"9611\"}', '您的验证码是：9611。请不要把验证码泄露给其他人。', 'ihuyi', '2', '0', '2019-07-11 09:07:54', '2019-07-11 09:07:55', '15628072755275253481', null, null);
INSERT INTO `sms` VALUES ('7aa722ebacd34317922bd83a584a7fc9', '1', '18857193039', '{\"verify\":\"2450\"}', '您的验证码是：2450。请不要把验证码泄露给其他人。', 'ihuyi', '2', '0', '2019-06-27 13:09:14', '2019-06-27 13:09:14', '0', null, null);
INSERT INTO `sms` VALUES ('7b41a4502cec475a947b7a79dbd68ad3', '1', '13646841512', '{\"verify\":\"3234\"}', '您的验证码是：3234。请不要把验证码泄露给其他人。', 'ihuyi', '2', '0', '2019-07-12 15:42:14', '2019-07-12 15:42:15', '15629173352453295893', null, null);
INSERT INTO `sms` VALUES ('7df564d7ddbe49d5b770a164174e856d', '1', '13646841512', '{\"verify\":\"1314\"}', '您的验证码是：1314。请不要把验证码泄露给其他人。', 'ihuyi', '2', '0', '2019-07-15 11:10:41', '2019-07-15 11:10:43', '15631602433455270718', null, null);
INSERT INTO `sms` VALUES ('7e9e8ed3a5e74f00bda430e3ca03c0dd', '1', '18375315178', '{\"verify\":\"1325\"}', '您的验证码是：1325。请不要把验证码泄露给其他人。', 'ihuyi', '2', '0', '2019-06-28 10:21:17', '2019-06-28 10:21:18', '15616884783029602690', null, null);
INSERT INTO `sms` VALUES ('80b5fa59fa504053bd4c0e615323df39', '1', '13646841512', '{\"verify\":\"8565\"}', '您的验证码是：8565。请不要把验证码泄露给其他人。', 'ihuyi', '2', '0', '2019-07-12 11:32:02', '2019-07-12 11:32:15', '15629023356853157032', null, null);
INSERT INTO `sms` VALUES ('87d7756b6ed341d7b967d0db104f4e5c', '1', '13646841512', '{\"verify\":\"0896\"}', '您的验证码是：0896。请不要把验证码泄露给其他人。', 'ihuyi', '2', '0', '2019-07-16 10:15:24', '2019-07-16 10:15:25', '15632433252552304070', null, null);
INSERT INTO `sms` VALUES ('892ed09333974c97bad12bd14d2fc14e', '1', '13646841512', '{\"verify\":\"8296\"}', '您的验证码是：8296。请不要把验证码泄露给其他人。', 'ihuyi', '2', '0', '2019-07-11 11:06:12', '2019-07-11 11:06:15', '15628143754886247968', null, null);
INSERT INTO `sms` VALUES ('8a48a104f95c480e8eb1d91b668a4295', '1', '18857193039', '{\"verify\":\"2198\"}', '您的验证码是：2198。请不要把验证码泄露给其他人。', 'ihuyi', '2', '0', '2019-06-28 10:20:12', '2019-06-28 10:20:15', '15616884155342239687', null, null);
INSERT INTO `sms` VALUES ('9f0c042e0b8b49c9a1d5e3dff98da8a7', '1', '13646841512', '{\"verify\":\"6564\"}', '您的验证码是：6564。请不要把验证码泄露给其他人。', 'ihuyi', '2', '0', '2019-07-15 10:26:48', '2019-07-15 10:26:49', '15631576097596248013', null, null);
INSERT INTO `sms` VALUES ('a28f6b530a3f45ab894abbd3d9ea1d62', '1', '13646841512', '{\"verify\":\"4961\"}', '您的验证码是：4961。请不要把验证码泄露给其他人。', 'ihuyi', '2', '0', '2019-07-12 09:29:43', '2019-07-12 09:29:44', '15628949842951256282', null, null);
INSERT INTO `sms` VALUES ('ac1ee88c038046d2bd3af8b477e12935', '1', '18375315178', '{\"verify\":\"5088\"}', '您的验证码是：5088。请不要把验证码泄露给其他人。', 'ihuyi', '2', '0', '2019-06-28 10:23:07', '2019-06-28 10:23:15', '15616885953553374875', null, null);
INSERT INTO `sms` VALUES ('afe7b3ff2c134ac0a0fe08cdbd27141e', '1', '13646841512', '{\"verify\":\"7280\"}', '您的验证码是：7280。请不要把验证码泄露给其他人。', 'ihuyi', '2', '0', '2019-07-11 11:08:22', '2019-07-11 11:08:23', '15628145034023191487', null, null);
INSERT INTO `sms` VALUES ('bb3fecaefdf046ed8716557b4e1d3ce0', '1', '18857193039', '{\"verify\":\"1939\"}', '您的验证码是：1939。请不要把验证码泄露给其他人。', 'ihuyi', '2', '0', '2019-06-28 10:08:10', '2019-06-28 10:08:11', '15616876917339350203', null, null);
INSERT INTO `sms` VALUES ('d40da826225c4ba5848261cdd7c456f9', '1', '18857193039', '{\"verify\":\"7538\"}', '您的验证码是：7538。请不要把验证码泄露给其他人。', 'ihuyi', '2', '0', '2019-06-28 10:17:24', '2019-06-28 10:17:25', '15616882454714271291', null, null);
INSERT INTO `sms` VALUES ('e3bb49c5488c49bbb8cae23b2bbaf333', '1', '18375315178', '{\"verify\":\"2054\"}', '您的验证码是：2054。请不要把验证码泄露给其他人。', 'ihuyi', '2', '0', '2019-06-28 10:30:09', '2019-06-28 10:30:15', '15616890155440229084', null, null);
INSERT INTO `sms` VALUES ('eb952236c408490b8af121c6df72c1de', '1', '17683861747', '{\"verify\":\"3114\"}', '您的验证码是：3114。请不要把验证码泄露给其他人。', 'ihuyi', '2', '0', '2019-07-11 14:52:26', '2019-07-11 14:52:27', '15628279472858210878', null, null);
INSERT INTO `sms` VALUES ('f6a61905eaaf4fb79d48d9d1c16763c0', '1', '13646841512', '{\"verify\":\"9250\"}', '您的验证码是：9250。请不要把验证码泄露给其他人。', 'ihuyi', '2', '0', '2019-07-12 15:33:14', '2019-07-12 15:33:15', '15629167955846260943', null, null);

-- ----------------------------
-- Table structure for `sms_failed`
-- ----------------------------
DROP TABLE IF EXISTS `sms_failed`;
CREATE TABLE `sms_failed` (
  `id` char(32) NOT NULL,
  `template` varchar(100) NOT NULL COMMENT '模板id',
  `receiver` varchar(100) NOT NULL COMMENT '接收人手机号码',
  `params` varchar(200) DEFAULT NULL COMMENT '模板参数列表，jso格式map',
  `content` varchar(255) DEFAULT NULL COMMENT '短信内容',
  `status` int(11) DEFAULT NULL COMMENT '状态',
  `create_time` timestamp NULL DEFAULT NULL COMMENT '创建时间',
  `update_time` timestamp NULL DEFAULT NULL COMMENT '修改时间',
  `times` int(11) DEFAULT NULL COMMENT '重试次数',
  `error_code` varchar(50) DEFAULT NULL COMMENT '错误代码',
  `error_msg` varchar(200) DEFAULT NULL COMMENT '错误信息',
  `smsid` varchar(100) DEFAULT NULL COMMENT '流水号',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

-- ----------------------------
-- Records of sms_failed
-- ----------------------------
INSERT INTO `sms_failed` VALUES ('116aee768b56488d8381bc4ab86b13b2', '1', '13646841512', '{\"verify\":\"4812\"}', '您的验证码是：4812。请不要把验证码泄露给其他人。', '4085', '2019-07-11 11:29:17', '2019-07-11 11:29:17', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('12005e8565aa419297eb18117f5b5c06', '1', '18375315178', '{\"verify\":\"394605\"}', '您的验证码是：394605。请不要把验证码泄露给其他人。', '4085', '2019-06-28 14:30:39', '2019-06-28 14:30:39', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('124dd4977b1b4fbaaaaf83c24b0aed8e', '1', '18375315178', '{\"verify\":\"113447\"}', '您的验证码是：113447。请不要把验证码泄露给其他人。', '4085', '2019-06-28 14:27:35', '2019-06-28 14:27:35', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('139fe58bf4c246609659246a551f503f', '1', '18375315178', '{\"verify\":\"728890\"}', '您的验证码是：728890。请不要把验证码泄露给其他人。', '4085', '2019-06-28 15:17:17', '2019-06-28 15:17:17', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('1b570ff43908406ebe0b58abc3a73598', '1', '18375315178', '{\"verify\":\"887858\"}', '您的验证码是：887858。请不要把验证码泄露给其他人。', '4085', '2019-06-28 14:43:37', '2019-06-28 14:43:37', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('27cd3b22570d475cb3075326d236e0fc', '1', '13646841512', '{\"verify\":\"8981\"}', '您的验证码是：8981。请不要把验证码泄露给其他人。', '4085', '2019-07-11 11:28:28', '2019-07-11 11:28:28', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('27d6d319cbc54803a0bcec79ad1c9e06', '111', '12', '123', '', '0', '2019-06-14 17:03:22', '2019-06-14 17:03:22', '2', '404', '短信内容不能为空', '0');
INSERT INTO `sms_failed` VALUES ('2de0883366594705a21e0a137cd1d14c', '1', '18375315178', '{\"verify\":\"009683\"}', '您的验证码是：009683。请不要把验证码泄露给其他人。', '4085', '2019-06-28 14:06:17', '2019-06-28 14:06:17', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('33ad4b70a05e499799d4ba2c375c514a', '1', '13646841512', '{\"verify\":\"3955\"}', '您的验证码是：3955。请不要把验证码泄露给其他人。', '4085', '2019-07-11 11:27:45', '2019-07-11 11:27:45', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('3dff5235c6354e91b836ae3425be81f0', '1', '17683861747', '{\"code\":\"123556\"}', '您的验证码是：123556。请不要把验证码泄露给其他人。', '0', '2019-06-05 22:17:58', '2019-06-05 22:18:01', '1', '4072', '你提交过来的短信内容必须与报备过的模板格式相匹配', null);
INSERT INTO `sms_failed` VALUES ('422089d5716e47ce9d0fca093e409f3f', '1', '17683861747', '{\"vitity\":\"216584\"}', '剩余条数不足', '0', '2019-06-14 10:31:56', '2019-06-14 10:31:56', '0', '4051', '0', '0');
INSERT INTO `sms_failed` VALUES ('4dfd02242c7f4c2fa53860f79c00569b', '1', '13646841512', '{\"verify\":\"0293\"}', '您的验证码是：0293。请不要把验证码泄露给其他人。', '4085', '2019-07-12 16:06:46', '2019-07-12 16:06:46', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('4f83354000ca496cb80a9d88a0f7b246', '1', '18375315178', '{\"verify\":\"767168\"}', '您的验证码是：767168。请不要把验证码泄露给其他人。', '4085', '2019-06-28 14:22:17', '2019-06-28 14:22:17', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('4fb98ad963f44250bb7d8ac86d1fa9fe', '1', '17683861747', '{\"vitity\":\"216584\"}', '剩余条数不足', '0', '2019-06-14 11:37:25', '2019-06-14 11:37:25', '0', '4051', '0', '0');
INSERT INTO `sms_failed` VALUES ('5282727bebae4c7d8c2d94e05c608fe5', '1', '13333333333', '{\"code\":\"739083\"}', '您的验证码是：739083。请不要把验证码泄露给其他人。', '0', '2019-06-13 11:13:48', '2019-06-13 11:13:48', '3', '4030', 'BLACK-Y', '0');
INSERT INTO `sms_failed` VALUES ('55da603a1a11440e9722a751bbf76d5e', '1', '13646841512', '{\"verify\":\"5452\"}', '您的验证码是：5452。请不要把验证码泄露给其他人。', '4085', '2019-07-11 15:55:54', '2019-07-11 15:55:54', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('5c375882bdba49fb8e7f19673caf9029', '111', '12', '123', '', '0', '2019-06-14 17:03:22', '2019-06-14 17:03:22', '2', '404', '短信内容不能为空', '0');
INSERT INTO `sms_failed` VALUES ('6020062964a240d99309a03eed5d23cd', '1', '13646841512', '{\"verify\":\"3277\"}', '您的验证码是：3277。请不要把验证码泄露给其他人。', '4085', '2019-07-11 14:41:31', '2019-07-11 14:41:31', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('62f22ce6663e44aca23faedef808a9a0', '1', '18375315178', '{\"verify\":\"223727\"}', '您的验证码是：223727。请不要把验证码泄露给其他人。', '4085', '2019-06-28 14:11:29', '2019-06-28 14:11:29', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('673f327c52f74822b2579374ba0e2714', '1', '17683861747', '{\"code\":\"475219\"}', '您的验证码是：475219。请不要把验证码泄露给其他人。', '0', '2019-06-11 11:50:29', '2019-06-11 11:50:29', '3', '4080', '同一手机号码同一秒钟之内发送频率不能超过1条(c)', '0');
INSERT INTO `sms_failed` VALUES ('67b1f1fd738545a79e750933c647d0a3', '1', '18375315178', '{\"verify\":\"182451\"}', '您的验证码是：182451。请不要把验证码泄露给其他人。', '4085', '2019-06-28 13:07:22', '2019-06-28 13:07:22', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('6ba99a86c0184403aefc87927d8e2c80', '1', '13646841512', '{\"verify\":\"1898\"}', '您的验证码是：1898。请不要把验证码泄露给其他人。', '4085', '2019-07-12 16:03:43', '2019-07-12 16:03:43', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('70209ca13f89474f886ee2ef525beda0', '1', '13646841512', '{\"verify\":\"2518\"}', '您的验证码是：2518。请不要把验证码泄露给其他人。', '4085', '2019-07-11 16:55:57', '2019-07-11 16:55:57', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('70a9c895a1e34420b8e9c4d836b9ff7e', '1', '13646841512', '{\"verify\":\"7916\"}', '您的验证码是：7916。请不要把验证码泄露给其他人。', '4085', '2019-07-11 11:18:56', '2019-07-11 11:18:56', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('70f0cc090bbf4274bcf3447b9a12bed9', '1', '18375315178', '{\"verify\":\"199298\"}', '您的验证码是：199298。请不要把验证码泄露给其他人。', '4085', '2019-06-28 14:15:54', '2019-06-28 14:15:54', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('717d82de59c14083af0c0c31d27c965b', '1', '17683861747', '{\"code\":\"305047\"}', '您的验证码是：305047。请不要把验证码泄露给其他人。', '0', '2019-06-11 11:44:25', '2019-06-11 11:44:25', '3', '4080', '同一手机号码同一秒钟之内发送频率不能超过1条(c)', '0');
INSERT INTO `sms_failed` VALUES ('74143d72c7f44635b551d02a831d5735', '1', '18375315178', '{\"verify\":\"360715\"}', '您的验证码是：360715。请不要把验证码泄露给其他人。', '4085', '2019-06-28 14:14:49', '2019-06-28 14:14:49', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('77761a7174374444a1758921bd45451b', '1', '17683861747', '{\"code\":\"123556\"}', '您的验证码是：123556。请不要把验证码泄露给其他人。', '0', '2019-06-11 09:24:27', '2019-06-11 09:24:27', '3', '4080', '同一手机号码同一秒钟之内发送频率不能超过1条(c)', null);
INSERT INTO `sms_failed` VALUES ('77cf0135af014e88b8c8242d3b712c10', '111', '12', '123', '', '0', '2019-06-14 17:03:22', '2019-06-14 17:03:22', '2', '404', '短信内容不能为空', '0');
INSERT INTO `sms_failed` VALUES ('785840fc25f6474a98510b4cf8d36c2c', '1', '18375315178', '{\"verify\":\"543407\"}', '您的验证码是：543407。请不要把验证码泄露给其他人。', '4085', '2019-06-28 13:25:47', '2019-06-28 13:25:47', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('78a0edb176ab4ac1ade90b836e882a4c', '1', '18375315178', '{\"verify\":\"865618\"}', '您的验证码是：865618。请不要把验证码泄露给其他人。', '4085', '2019-06-28 14:20:53', '2019-06-28 14:20:53', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('79d28439eabc42a8bb676d39a566ce11', '1', '18375315178', '{\"verify\":\"272229\"}', '您的验证码是：272229。请不要把验证码泄露给其他人。', '4085', '2019-06-28 14:27:17', '2019-06-28 14:27:17', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('8300df0649a74838807ee78c48dd4632', '111', '12', '123', '', '0', '2019-06-14 17:03:58', '2019-06-14 17:03:58', '2', '404', '短信内容不能为空', '0');
INSERT INTO `sms_failed` VALUES ('843939f119304f5c88e3cc24d42b9682', '111', '12', '123', '', '0', '2019-06-14 17:06:17', '2019-06-14 17:06:17', '2', '404', '短信内容不能为空', '0');
INSERT INTO `sms_failed` VALUES ('86824005822d4e1ba0e232eace560db7', '1', '18375315178', '{\"verify\":\"827515\"}', '您的验证码是：827515。请不要把验证码泄露给其他人。', '4085', '2019-06-28 13:44:29', '2019-06-28 13:44:29', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('86dd2e4ce9dc487cba10e2016d16f552', '1', '18375315178', '{\"verify\":\"885891\"}', '您的验证码是：885891。请不要把验证码泄露给其他人。', '4085', '2019-06-28 14:45:17', '2019-06-28 14:45:17', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('8b493b08d0c24f4eb1afa2e2d8ee9567', '1', '17683861747', '{\"code\":\"123556\"}', '您的验证码是：123556。请不要把验证码泄露给其他人。【{{qianmian}}】', '0', '2019-06-05 23:42:21', '2019-06-05 23:42:25', '3', '4072', '你提交过来的短信内容必须与报备过的模板格式相匹配', null);
INSERT INTO `sms_failed` VALUES ('8dc87ed7e3d54720975e661322b56661', '1', '18375315178', '{\"verify\":\"420965\"}', '您的验证码是：420965。请不要把验证码泄露给其他人。', '4085', '2019-06-28 14:06:24', '2019-06-28 14:06:24', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('90fece62f1604690a21e6c9d17f68884', '1', '18375315178', '{\"verify\":\"272778\"}', '您的验证码是：272778。请不要把验证码泄露给其他人。', '4085', '2019-06-28 14:09:17', '2019-06-28 14:09:17', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('915484ff9360452aa2c28360a0e15d3e', '111', '12', '123', '', '0', '2019-06-14 17:06:49', '2019-06-14 17:06:49', '2', '404', '短信内容不能为空', '0');
INSERT INTO `sms_failed` VALUES ('93c4d02ea59c4ef9a4e74c1c2261cfe6', '1', '17683861747', '{\"vitity\":\"216584\"}', '剩余条数不足', '0', '2019-06-11 13:01:06', '2019-06-14 11:40:27', '0', '4051', '0', '0');
INSERT INTO `sms_failed` VALUES ('95ff6045408f46509697cc9605de9f99', '1', '18375315178', '{\"verify\":\"767248\"}', '您的验证码是：767248。请不要把验证码泄露给其他人。', '4085', '2019-06-28 14:22:37', '2019-06-28 14:22:37', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('9711a34416f24abfb7c21a97aa078840', '1', '18375315178', '{\"verify\":\"282866\"}', '您的验证码是：282866。请不要把验证码泄露给其他人。', '4085', '2019-06-28 13:10:49', '2019-06-28 13:10:49', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('9e324508b2dc4490a339aa58e080268a', '1', '18375315178', '{\"verify\":\"121733\"}', '您的验证码是：121733。请不要把验证码泄露给其他人。', '4085', '2019-06-28 14:32:49', '2019-06-28 14:32:49', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('9f3933bc55f24589b0ec750869220753', '1', '18375315178', '{\"verify\":\"004604\"}', '您的验证码是：004604。请不要把验证码泄露给其他人。', '4085', '2019-06-28 14:24:29', '2019-06-28 14:24:29', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('a08128f1a82b4f768557fa6df2880dc0', '1', '18375315178', '{\"verify\":\"806296\"}', '您的验证码是：806296。请不要把验证码泄露给其他人。', '4085', '2019-06-28 13:50:28', '2019-06-28 13:50:28', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('a2509e605356438aaf9c1370dfc8e266', '1', '13646841512', '{\"verify\":\"5876\"}', '您的验证码是：5876。请不要把验证码泄露给其他人。', '4085', '2019-07-11 13:35:28', '2019-07-11 13:35:28', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('a48792a5cfc245a5924272c6f598e8ad', '1', '18375315178', '{\"verify\":\"027551\"}', '您的验证码是：027551。请不要把验证码泄露给其他人。', '4085', '2019-06-28 14:07:54', '2019-06-28 14:07:54', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('a640f937d37e45bdae2e62ac05d44dba', '1', '17683861747', '{\"vitity\":\"216584\"}', '剩余条数不足', '0', '2019-06-14 11:31:41', '2019-06-14 11:31:41', '0', '4051', '0', '0');
INSERT INTO `sms_failed` VALUES ('a76df0974ced4d13b6ac40a09aa0f7c0', '1', '17683861747', '{\"vitity\":\"216584\"}', '剩余条数不足', '0', '2019-06-14 11:40:27', '2019-06-14 11:40:27', '0', '4051', '0', '0');
INSERT INTO `sms_failed` VALUES ('abd0a48f28c145428767ad011b7f576e', '1', '18375315178', '{\"verify\":\"828736\"}', '您的验证码是：828736。请不要把验证码泄露给其他人。', '4085', '2019-06-28 14:30:17', '2019-06-28 14:30:17', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('aed2b93b31764bc799c0c4ee5b59fbbc', '1', '13646841512', '{\"verify\":\"4574\"}', '您的验证码是：4574。请不要把验证码泄露给其他人。', '4085', '2019-07-12 17:14:41', '2019-07-12 17:14:41', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('aedc14d14a9f43038e1c62d0684d3d76', '1', '18375315178', '{\"verify\":\"624913\"}', '您的验证码是：624913。请不要把验证码泄露给其他人。', '4085', '2019-06-28 11:35:37', '2019-06-28 11:35:37', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('b0b78b0939b94d4595c0c29490740bc3', '1', '18375315178', '{\"verify\":\"272070\"}', '您的验证码是：272070。请不要把验证码泄露给其他人。', '4085', '2019-06-28 13:09:17', '2019-06-28 13:09:17', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('b330a82b9f7242c7baf3a90917cadcef', '1', '13646841512', '{\"verify\":\"5614\"}', '您的验证码是：5614。请不要把验证码泄露给其他人。', '4085', '2019-07-11 16:40:17', '2019-07-11 16:40:17', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('b7ce1e8ef1f641bdbe53fd2eeb6bdc28', '1', '13646841512', '{\"verify\":\"4261\"}', '您的验证码是：4261。请不要把验证码泄露给其他人。', '4085', '2019-07-11 11:34:17', '2019-07-11 11:34:17', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('b94e04bdf38b4548896524b25f546ace', '1', '18375315178', '{\"verify\":\"726792\"}', '您的验证码是：726792。请不要把验证码泄露给其他人。', '4085', '2019-06-28 14:38:17', '2019-06-28 14:38:17', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('bc4eaa827e3f4fb7a051060a14858d4c', '1', '18375315178', '{\"verify\":\"862262\"}', '您的验证码是：862262。请不要把验证码泄露给其他人。', '4085', '2019-06-28 14:27:36', '2019-06-28 14:27:36', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('c1aa0ea8ae0f4b478c03dc29cab10096', '1', '17683861747', '{\"code\":\"123556\"}', '您的验证码是：123556。请不要把验证码泄露给其他人。', '0', '2019-06-11 09:24:28', '2019-06-11 09:24:28', '3', '4080', '同一手机号码同一秒钟之内发送频率不能超过1条(c)', null);
INSERT INTO `sms_failed` VALUES ('c588af7fb2fe41edac1e0f5ebd9a868f', '1', '18375315178', '{\"verify\":\"254347\"}', '您的验证码是：254347。请不要把验证码泄露给其他人。', '4085', '2019-06-28 13:11:37', '2019-06-28 13:11:37', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('c828b17057ea47498f825fc0ab043a4a', '1', '17683861747', '{\"code\":\"608250\"}', '您的验证码是：608250。请不要把验证码泄露给其他人。', '0', '2019-06-11 10:57:46', '2019-06-11 10:57:46', '3', '4085', '同一手机号验证码短信发送超出5条', null);
INSERT INTO `sms_failed` VALUES ('c85c208ec9ae4e4caf21477874688aac', '1', '18375315178', '{\"verify\":\"759608\"}', '您的验证码是：759608。请不要把验证码泄露给其他人。', '4080', '2019-06-28 14:30:17', '2019-06-28 14:30:17', '3', '4080', '同一手机号码同一秒钟之内发送频率不能超过1条(c)', '0');
INSERT INTO `sms_failed` VALUES ('ca04bbafff004c0c930a6f70d704b93d', '1', '18375315178', '{\"verify\":\"182583\"}', '您的验证码是：182583。请不要把验证码泄露给其他人。', '4085', '2019-06-28 13:11:17', '2019-06-28 13:11:17', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('cf87684a4b00478ea9f9eaca7b59b626', '1', '18375315178', '{\"verify\":\"924902\"}', '您的验证码是：924902。请不要把验证码泄露给其他人。', '4085', '2019-06-28 15:16:26', '2019-06-28 15:16:26', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('d4e55397cc72455d8e49913385fef4ab', '1', '17683861747', '{\"code\":\"284002\"}', '您的验证码是：284002。请不要把验证码泄露给其他人。', '0', '2019-06-11 10:49:44', '2019-06-11 10:49:44', '3', '4085', '同一手机号验证码短信发送超出5条', null);
INSERT INTO `sms_failed` VALUES ('d552083b8093496db71f4607a0b2ce25', '1', '13646841512', '{\"verify\":\"1712\"}', '您的验证码是：1712。请不要把验证码泄露给其他人。', '4085', '2019-07-11 15:12:36', '2019-07-11 15:12:36', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('d5d9b747858a4e03a9c1f7da7b49ae73', '1', '13646841512', '{\"verify\":\"0540\"}', '您的验证码是：0540。请不要把验证码泄露给其他人。', '4085', '2019-07-11 14:47:32', '2019-07-11 14:47:32', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('d8aaed9faea74aa48c2c18e7b293729b', '1', '18375315178', '{\"verify\":\"443366\"}', '您的验证码是：443366。请不要把验证码泄露给其他人。', '4085', '2019-06-28 14:23:39', '2019-06-28 14:23:39', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('dec928195b754f63b84238c9f046b7b4', '1', '13646841512', '{\"verify\":\"7831\"}', '您的验证码是：7831。请不要把验证码泄露给其他人。', '4085', '2019-07-11 16:55:35', '2019-07-11 16:55:35', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('e112c321d6fb40caa92cf40e57ce04b0', '1', '17683861747', '{\"vitity\":\"216584\"}', '剩余条数不足', '0', '2019-06-14 11:35:37', '2019-06-14 11:35:37', '0', '4051', '0', '0');
INSERT INTO `sms_failed` VALUES ('e1cc8fc7a5a54bc2b704b377a5b4dc26', '1', '18375315178', '{\"verify\":\"236533\"}', '您的验证码是：236533。请不要把验证码泄露给其他人。', '4085', '2019-06-28 13:13:17', '2019-06-28 13:13:17', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('e218a130ac434cc2bb29c9cdc5aa4b2e', '1', '18375315178', '{\"verify\":\"384521\"}', '您的验证码是：384521。请不要把验证码泄露给其他人。', '4085', '2019-06-28 14:16:54', '2019-06-28 14:16:54', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('e29553b6b79840458dc2025375db9e75', '1', '18375315178', '{\"verify\":\"351586\"}', '您的验证码是：351586。请不要把验证码泄露给其他人。', '4080', '2019-06-28 14:27:36', '2019-06-28 14:27:36', '3', '4080', '同一手机号码同一秒钟之内发送频率不能超过1条(c)', '0');
INSERT INTO `sms_failed` VALUES ('e4221bd458db41dbb21c494ec4c0cf4a', '1', '18375315178', '{\"verify\":\"394060\"}', '您的验证码是：394060。请不要把验证码泄露给其他人。', '4085', '2019-06-28 13:51:17', '2019-06-28 13:51:17', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('e5164c17e226442092632cef2b45893c', '1', '18375315178', '{\"verify\":\"894384\"}', '您的验证码是：894384。请不要把验证码泄露给其他人。', '4085', '2019-06-28 13:09:36', '2019-06-28 13:09:36', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('e5ee197d84d04eaeb28f9d7c1209fec0', '1', '13646841512', '{\"verify\":\"3492\"}', '您的验证码是：3492。请不要把验证码泄露给其他人。', '4085', '2019-07-11 17:11:50', '2019-07-11 17:11:50', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('ea7cf0f577be409bb5d1d027fd5e4a4a', '111', '12', '123', '', '0', '2019-06-14 17:06:49', '2019-06-14 17:06:49', '2', '404', '短信内容不能为空', '0');
INSERT INTO `sms_failed` VALUES ('ec532f4472ab49669ca05445acbf8e20', '1', '18375315178', '{\"verify\":\"231716\"}', '您的验证码是：231716。请不要把验证码泄露给其他人。', '4085', '2019-06-28 13:45:26', '2019-06-28 13:45:26', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('f1dae8ff5fdd47558900b22c692bf0a0', '1', '13646841512', '{\"verify\":\"0757\"}', '您的验证码是：0757。请不要把验证码泄露给其他人。', '4085', '2019-07-11 15:25:46', '2019-07-11 15:25:46', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('f254a6bd234840c5945c6e5a0ed86f9c', '1', '13646841512', '{\"verify\":\"7924\"}', '您的验证码是：7924。请不要把验证码泄露给其他人。', '4085', '2019-07-11 11:11:54', '2019-07-11 11:11:54', '3', '4085', '同一手机号验证码短信发送超出5条', '0');
INSERT INTO `sms_failed` VALUES ('f4b0dad0072e41718c549723d6354fe0', '111', '12', '123', '', '0', '2019-06-14 17:06:52', '2019-06-14 17:06:52', '2', '404', '短信内容不能为空', '0');
INSERT INTO `sms_failed` VALUES ('fc97862b7d8c41d7a79c0fbaa1c1d09c', '111', '12', '123', '', '0', '2019-06-14 17:06:53', '2019-06-14 17:06:53', '2', '404', '短信内容不能为空', '0');

-- ----------------------------
-- Table structure for `sms_record`
-- ----------------------------
DROP TABLE IF EXISTS `sms_record`;
CREATE TABLE `sms_record` (
  `id` char(32) NOT NULL,
  `template` varchar(100) NOT NULL COMMENT '模板id',
  `receiver` varchar(100) NOT NULL COMMENT '接收人手机号码',
  `params` varchar(200) DEFAULT NULL COMMENT '模板参数列表，json格式map',
  `content` varchar(255) DEFAULT NULL COMMENT '短信内容',
  `status` int(11) DEFAULT NULL COMMENT '状态',
  `create_time` timestamp NULL DEFAULT NULL COMMENT '创建时间',
  `update_time` timestamp NULL DEFAULT NULL COMMENT '修改时间',
  `times` int(11) DEFAULT NULL COMMENT '重试次数',
  `remark` varchar(200) DEFAULT NULL COMMENT '备注',
  `smsid` varchar(100) DEFAULT NULL COMMENT '流水号',
  PRIMARY KEY (`id`) USING BTREE,
  KEY `idx_sms_record_receiver` (`receiver`) USING BTREE,
  KEY `idx_sms_record_create_time` (`create_time`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

-- ----------------------------
-- Records of sms_record
-- ----------------------------
INSERT INTO `sms_record` VALUES ('05cfb0b0a11e4abc9adcc7bb731588ad', '1', '17683861747', '{\"code\":\"123556\"}', '您的验证码是：123556。请不要把验证码泄露给其他人。', '0', '2019-06-05 23:56:56', '2019-06-05 23:56:56', '0', '发送验证码', '0');
INSERT INTO `sms_record` VALUES ('74ec5e5d5b08406aa4958f02d7c312df', '1', '17683861747', '{\"code\":\"123556\"}', '您的验证码是：123556。请不要把验证码泄露给其他人。', '0', '2019-06-05 23:59:47', '2019-06-05 23:59:49', '0', '发送验证码', '0');
INSERT INTO `sms_record` VALUES ('984bad9eba1a47309213726092d6f444', '1', '17683861747', '{\"code\":\"123556\"}', '您的验证码是：123556。请不要把验证码泄露给其他人。', '0', '2019-06-05 23:56:57', '2019-06-05 23:56:57', '0', '发送验证码', '0');
INSERT INTO `sms_record` VALUES ('e5c268ea39394f8c90cfb5779c5cc76c', '1', '17683861747', '{\"code\":\"123556\"}', '您的验证码是：123556。请不要把验证码泄露给其他人。', '0', '2019-06-05 23:56:59', '2019-06-05 23:56:59', '1', '发送验证码', '0');
INSERT INTO `sms_record` VALUES ('f4b0dad0072e41718c549723d6354fe0', '1', '17683861747', '{\"verify\":\"997043\"}', '您的验证码是：997043。请不要把验证码泄露给其他人。', '0', '2019-06-14 10:47:45', '2019-06-14 10:47:45', '0', '发送验证码', '15604168137355121985');

-- ----------------------------
-- Table structure for `template`
-- ----------------------------
DROP TABLE IF EXISTS `template`;
CREATE TABLE `template` (
  `code` varchar(50) NOT NULL COMMENT '模板代号',
  `name` varchar(100) NOT NULL COMMENT '模板名称',
  `tcontent` varchar(255) NOT NULL COMMENT '模板内容',
  `remark` varchar(255) DEFAULT NULL COMMENT '说明',
  PRIMARY KEY (`code`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

-- ----------------------------
-- Records of template
-- ----------------------------
INSERT INTO `template` VALUES ('1', '验证码', '您的验证码是：{{verify}}。请不要把验证码泄露给其他人。', '发送验证码');
INSERT INTO `template` VALUES ('2', '验证码', '您的验证码是：{{code}}。请不要把验证码泄露给其他人。', '发送验证码');
